20220621/Catalogs/тм_ДинамическиеПодписки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>тм_ДинамическиеПодписки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсточникиПодписки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИсточникПодписки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

20220621/Catalogs/тм_ДинамическиеПодписки/Ext/ManagerModule.bsl
Функция ДоступныеПодписки(ТипОбъекта, Событие, ИсточникПодписки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тм_ДинамическиеПодписки.КодВыполнения КАК КодВыполнения
		|ИЗ
		|	Справочник.тм_ДинамическиеПодписки.ИсточникиПодписки КАК тм_ДинамическиеПодпискиИсточникиПодписки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.тм_ДинамическиеПодписки КАК тм_ДинамическиеПодписки
		|		ПО тм_ДинамическиеПодпискиИсточникиПодписки.Ссылка = тм_ДинамическиеПодписки.Ссылка
		|ГДЕ
		|	тм_ДинамическиеПодписки.Использовать
		|	И тм_ДинамическиеПодписки.ТипОбъекта = &ТипОбъекта
		|	И тм_ДинамическиеПодпискиИсточникиПодписки.ИсточникПодписки = &ИсточникПодписки
		|	И тм_ДинамическиеПодписки.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Событие", Событие);
	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("ИсточникПодписки", ИсточникПодписки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции // ДоступныеПодписки()
